In [2]:
import pandas as pd

In [3]:
students_list = {'FName':['Oscar','EMMA','JOY','MUTUMBA'],
                 'LName':['Odonkara','Edube','Awori','Benja'],
                 'Age':[24,20,21,22],
                 'Major':['Dta','Computer','Math','Network'],
                 'score':[90,96,92,94]}

In [4]:
df1 = pd.DataFrame(students_list)

In [5]:
df1

     FName     LName  Age     Major  score
0    Oscar  Odonkara   24       Dta     90
1     EMMA     Edube   20  Computer     96
2      JOY     Awori   21      Math     92
3  MUTUMBA     Benja   22   Network     94

In [6]:
df1.describe()

             Age      score
count   4.000000   4.000000
mean   21.750000  93.000000
std     1.707825   2.581989
min    20.000000  90.000000
25%    20.750000  91.500000
50%    21.500000  93.000000
75%    22.500000  94.500000
max    24.000000  96.000000

In [7]:
df1.shape

(4, 5)

In [9]:
df1 = pd.DataFrame(students_list, columns=['FName','Major'])

In [10]:
df1

     FName     Major
0    Oscar       Dta
1     EMMA  Computer
2      JOY      Math
3  MUTUMBA   Network

In [11]:
df1.tail(1)

     FName    Major
3  MUTUMBA  Network